In [5]:
import os

In [3]:
import numpy as np
import pandas as pd 
import scipy
import matplotlib

import sklearn
import lightgbm
import xgboost

for p in [np, pd, sklearn, matplotlib, scipy, lightgbm, xgboost]:
    print (p.__name__, p.__version__)

numpy 1.18.1
pandas 0.24.2
sklearn 0.22.1
matplotlib 3.1.1
scipy 1.4.1
lightgbm 2.3.1
xgboost 1.0.2

# Load data

In [17]:
DATA_FOLDER = './data/'

transactions    = pd.read_csv(os.path.join(DATA_FOLDER, 'sales_train.csv'))
items           = pd.read_csv(os.path.join(DATA_FOLDER, 'items.csv'))
item_categories = pd.read_csv(os.path.join(DATA_FOLDER, 'item_categories.csv'))
shops           = pd.read_csv(os.path.join(DATA_FOLDER, 'shops.csv'))

sample_submission = pd.read_csv(os.path.join(DATA_FOLDER, 'sample_submission.csv'))

In [9]:
transactions.shape, items.shape, item_categories.shape, shops.shape

((2935849, 6), (22170, 3), (84, 2), (60, 2))

In [15]:
transactions.head().T

                         0           1           2           3           4
date            02.01.2013  03.01.2013  05.01.2013  06.01.2013  15.01.2013
date_block_num           0           0           0           0           0
shop_id                 59          25          25          25          25
item_id              22154        2552        2552        2554        2555
item_price             999         899         899     1709.05        1099
item_cnt_day             1           1          -1           1           1

In [14]:
items.head().T

,0,1,2,3,4
item_name,! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.) D,!ABBYY FineReader 12 Professional Edition Full...,***В ЛУЧАХ СЛАВЫ (UNV) D,***ГОЛУБАЯ ВОЛНА (Univ) D,***КОРОБКА (СТЕКЛО) D
item_id,0,1,2,3,4
item_category_id,40,76,40,40,40

In [13]:
item_categories.head().T

,0,1,2,3,4
item_category_name,PC - Гарнитуры/Наушники,Аксессуары - PS2,Аксессуары - PS3,Аксессуары - PS4,Аксессуары - PSP
item_category_id,0,1,2,3,4

In [16]:
shops.head().T

,0,1,2,3,4
shop_name,"!Якутск Орджоникидзе, 56 фран","!Якутск ТЦ ""Центральный"" фран","Адыгея ТЦ ""Мега""","Балашиха ТРК ""Октябрь-Киномир""","Волжский ТЦ ""Волга Молл"""
shop_id,0,1,2,3,4

In [18]:
sample_submission.head().T

                  0    1    2    3    4
ID              0.0  1.0  2.0  3.0  4.0
item_cnt_month  0.5  0.5  0.5  0.5  0.5